# OmniclassDescription Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..OmniclassDescription Property
ParameterTypeId Class See Also
---
"OmniClass Title"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId OmniclassDescription { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OmniclassDescription As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ OmniclassDescription {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace